<unk>	0
<s>	0
</s>	0
<pad>	0
<0x00>	0
<0x01>	0
<0x02>	0
<0x03>	0
<0x04>	0
<0x05>	0
<0x06>	0
<0x07>	0
<0x08>	0
<0x09>	0
<0x0A>	0
<0x0B>	0
<0x0C>	0
<0x0D>	0
<0x0E>	0
<0x0F>	0
<0x10>	0
<0x11>	0
<0x12>	0
<0x13>	0
<0x14>	0
<0x15>	0
<0x16>	0
<0x17>	0
<0x18>	0
<0x19>	0
<0x1A>	0
<0x1B>	0
<0x1C>	0
<0x1D>	0
<0x1E>	0
<0x1F>	0
<0x20>	0
<0x21>	0
<0x22>	0
<0x23>	0
<0x24>	0
<0x25>	0
<0x26>	0
<0x27>	0
<0x28>	0
<0x29>	0
<0x2A>	0
<0x2B>	0
<0x2C>	0
<0x2D>	0
<0x2E>	0
<0x2F>	0
<0x30>	0
<0x31>	0
<0x32>	0
<0x33>	0
<0x34>	0
<0x35>	0
<0x36>	0
<0x37>	0
<0x38>	0
<0x39>	0
<0x3A>	0
<0x3B>	0
<0x3C>	0
<0x3D>	0
<0x3E>	0
<0x3F>	0
<0x40>	0
<0x41>	0
<0x42>	0
<0x43>	0
<0x44>	0
<0x45>	0
<0x46>	0
<0x47>	0
<0x48>	0
<0x49>	0
<0x4A>	0
<0x4B>	0
<0x4C>	0
<0x4D>	0
<0x4E>	0
<0x4F>	0
<0x50>	0
<0x51>	0
<0x52>	0
<0x53>	0
<0x54>	0
<0x55>	0
<0x56>	0
<0x57>	0
<0x58>	0
<0x59>	0
<0x5A>	0
<0x5B>	0
<0x5C>	0
<0x5D>	0
<0x5E>	0
<0x5F>	0
<0x60>	0
<0x61>	0
<0x62>	0
<0x63>	0
<0x64>	0
<0x65>	0
<0x66>	0
<0x67>	0
<0x68>	0
<0x69>	0
<0x6A>	0
<0x6B>	0
<0x6C>	0
<0x6D>	0
<0x6E>	0
<0x6F>	0
<0x70>	0
<0x71>	0
<0x72>	0
<0x73>	0
<0x74>	0
<0x75>	0
<0x76>	0
<0x77>	0
<0x78>	0
<0x79>	0
<0x7A>	0
<0x7B>	0
<0x7C>	0
<0x7D>	0
<0x7E>	0
<0x7F>	0
<0x80>	0
<0x81>	0
<0x82>	0
<0x83>	0
<0x84>	0
<0x85>	0
<0x86>	0
<0x87>	0
<0x88>	0
<0x89>	0
<0x8A>	0
<0x8B>	0
<0x8C>	0
<0x8D>	0
<0x8E>	0
<0x8F>	0
<0x90>	0
<0x91>	0
<0x92>	0
<0x93>	0
<0x94>	0
<0x95>	0
<0x96>	0
<0x97>	0
<0x98>	0
<0x99>	0
<0x9A>	0
<0x9B>	0
<0x9C>	0
<0x9D>	0
<0x9E>	0
<0x9F>	0
<0xA0>	0
<0xA1>	0
<0xA2>	0
<0xA3>	0
<0xA4>	0
<0xA5>	0
<0xA6>	0
<0xA7>	0
<0xA8>	0
<0xA9>	0
<0xAA>	0
<0xAB>	0
<0xAC>	0
<0xAD>	0
<0xAE>	0
<0xAF>	0
<0xB0>	0
<0xB1>	0
<0xB2>	0
<0xB3>	0
<0xB4>	0
<0xB5>	0
<0xB6>	0
<0xB7>	0
<0xB8>	0
<0xB9>	0
<0xBA>	0
<0xBB>	0
<0xBC>	0
<0xBD>	0
<0xBE>	0
<0xBF>	0
<0xC0>	0
<0xC1>	0
<0xC2>	0
<0xC3>	0
<0xC4>	0
<0xC5>	0
<0xC6>	0
<0xC7>	0
<0xC8>	0
<0xC9>	0
<0xCA>	0
<0xCB>	0
<0xCC>	0
<0xCD>	0
<0xCE>	0
<0xCF>	0
<0xD0>	0
<0xD1>	0
<0xD2>	0
<0xD3>	0
<0xD4>	0
<0xD5>	0
<0xD6>	0
<0xD7>	0
<0xD8>	0
<0xD9>	0
<0xDA>	0
<0xDB>	0
<0xDC>	0
<0xDD>	0
<0xDE>	0
<0xDF>	0
<0xE0>	0
<0xE1>	0
<0xE2>	0
<0xE3>	0
<0xE4>	0
<0xE5>	0
<0xE6>	0
<0xE7>	0
<0xE8>	0
<0xE9>	0
<0xEA>	0
<0xEB>	0
<0xEC>	0
<0xED>	0
<0xEE>	0
<0xEF>	0
<0xF0>	0
<0xF1>	0
<0xF2>	0
<0xF3>	0
<0xF4>	0
<0xF5>	0
<0xF6>	0
<0xF7>	0
<0xF8>	0
<0xF9>	0
<0xFA>	0
<0xFB>	0
<0xFC>	0
<0xFD>	0
<0xFE>	0
<0xFF>	0
▁▁	-0
th	-1
▁▁▁▁	-2
in	-3
the	-4
▁,	-5
▁.	-6
▁▁▁	-7
re	-8
is	-9
or	-10
er	-11
an	-12
le	-13
▁)	-14
on	-15
ut	-16
▁_	-17
en	-18
at	-19
st	-20
ch	-21
al	-22
▁▁▁▁▁▁▁▁	-23
se	-24
it	-25
to	-26
es	-27
ro	-28
co	-29
▁:	-30
▁'	-31
ing	-32
ed	-33
So	-34
um	-35
and	-36
ar	-37
for	-38
▁(	-39
of	-40
de	-41
▁=	-42
mp	-43
▁]	-44
be	-45
ct	-46
ach	-47
ion	-48
ma	-49
no	-50
if	-51
he	-52
po	-53
ent	-54
▁-	-55
ce	-56
▁[	-57
nt	-58
ble	-59
im	-60
▁▁▁▁▁▁▁	-61
are	-62
pro	-63
ex	-64
ap	-65
as	-66
ir	-67
each	-68
But	-69
that	-70
ve	-71
ul	-72
ig	-73
ter	-74
ur	-75
pos	-76
ow	-77
sum	-78
all	-79
wh	-80
si	-81
ge	-82
mple	-83
con	-84
put	-85
can	-86
ne	-87
▁▁▁▁▁▁▁▁▁▁▁	-88
qu	-89
ample	-90
we	-91
int	-92
ck	-93
ay	-94
ad	-95
this	-96
ment	-97
max	-98
ly	-99
mo	-100
▁).	-101
wo	-102
su	-103
The	-104
per	-105
Th	-106
ca	-107
For	-108
min	-109
wi	-110
ist	-111
num	-112
id	-113
ait	-114
▁+	-115
▁),	-116
cur	-117
uld	-118
me	-119
but	-120
ber	-121
rent	-122
not	-123
ich	-124
number	-125
up	-126
so	-127
sible	-128
pa	-129
ces	-130
val	-131
ate	-132
code	-133
pre	-134
comp	-135
irst	-136
ver	-137
Wait	-138
ep	-139
igh	-140
with	-141
ll	-142
tr	-143
pl	-144
possible	-145
art	-146
unt	-147
current	-148
then	-149
example	-150
str	-151
rom	-152
first	-153
which	-154
from	-155
ions	-156
step	-157
▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁	-158
act	-159
count	-160
us	-161
ther	-162
out	-163
di	-164
ive	-165
il	-166
use	-167
ele	-168
rect	-169
ta	-170
Then	-171
et	-172
ord	-173
element	-174
▁▁▁▁▁▁	-175
un	-176
ute	-177
end	-178
lo	-179
here	-180
input	-181
would	-182
blem	-183
by	-184
ight	-185
problem	-186
ven	-187
ind	-188
case	-189
tim	-190
ke	-191
ran	-192
len	-193
▁*	-194
posit	-195
pr	-196
▁()	-197
imum	-198
aps	-199
fi	-200
ue	-201
ort	-202
ha	-203
ust	-204
one	-205
▁s	-206
sub	-207
lin	-208
where	-209
two	-210
appro	-211
set	-212
compute	-213
ation	-214
▁?	-215
approach	-216
list	-217
how	-218
ince	-219
new	-220
fo	-221
haps	-222
ree	-223
col	-224
▁e	-225
af	-226
any	-227
have	-228
ip	-229
maximum	-230
perhaps	-231
when	-232
tal	-233
need	-234
▁):	-235
che	-236
ame	-237
red	-238
Let	-239
ac	-240
must	-241
output	-242
arr	-243
range	-244
tern	-245
ative	-246
cor	-247
ges	-248
▁a	-249
check	-250
steps	-251
has	-252
te	-253
sample	-254
node	-255
cess	-256
add	-257
cause	-258
elements	-259
its	-260
pair	-261
If	-262
ft	-263
ans	-264
In	-265
>=	-266
fe	-267
start	-268
line	-269
bo	-270
Al	-271
correct	-272
left	-273
after	-274
total	-275
find	-276
op	-277
res	-278
▁n	-279
ext	-280
ers	-281
des	-282
ba	-283
ult	-284
there	-285
<=	-286
right	-287
order	-288
..	-289
iti	-290
time	-291
array	-292
sed	-293
==	-294
path	-295
row	-296
string	-297
▁x	-298
part	-299
▁i	-300
sh	-301
app	-302
gr	-303
cond	-304
sort	-305
ternative	-306
el	-307
gi	-308
mod	-309
imal	-310
even	-311
li	-312
com	-313
▁^	-314
Alternative	-315
inal	-316
dist	-317
point	-318
other	-319
way	-320
edges	-321
Be	-322
next	-323
prev	-324
bet	-325
char	-326
ast	-327
Because	-328
▁/	-329
form	-330
leng	-331
process	-332
main	-333
same	-334
inc	-335
such	-336
▁k	-337
length	-338
minimal	-339
fix	-340
les	-341
plit	-342
▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁	-343
dif	-344
▁][	-345
▁].	-346
may	-347
ack	-348
do	-349
ze	-350
print	-351
iginal	-352
urn	-353
requ	-354
Alternatively	-355
cell	-356
ou	-357
▁],	-358
sorted	-359
ink	-360
dig	-361
let	-362
position	-363
mat	-364
▁}	-365
turn	-366
itial	-367
their	-368
state	-369
wer	-370
ween	-371
valid	-372
del	-373
roup	-374
between	-375
charact	-376
original	-377
ves	-378
os	-379
think	-380
else	-381
▁"	-382
ot	-383
group	-384
ren	-385
cy	-386
pe	-387
vis	-388
ations	-389
ose	-390
see	-391
nodes	-392
dp	-393
edge	-394
ity	-395
inter	-396
tree	-397
und	-398
▁>	-399
arge	-400
ain	-401
od	-402
am	-403
ci	-404
ors	-405
than	-406
requi	-407
uct	-408
able	-409
zer	-410
ic	-411
test	-412
lect	-413
ance	-414
ild	-415
Wh	-416
sequ	-417
since	-418
quer	-419
answer	-420
+=	-421
▁))	-422
ates	-423
remain	-424
diffe	-425
equ	-426
ger	-427
return	-428
lu	-429
que	-430
inte	-431
move	-432
ard	-433
inde	-434
ence	-435
low	-436
▁b	-437
read	-438
ins	-439
into	-440
you	-441
second	-442
ab	-443
initial	-444
pres	-445
positions	-446
pairs	-447
ty	-448
wor	-449
sho	-450
mult	-451
given	-452
onent	-453
ri	-454
sol	-455
adj	-456
index	-457
Now	-458
should	-459
cost	-460
allow	-461
value	-462
prefix	-463
direct	-464
ms	-465
▁])	-466
numbers	-467
some	-468
rea	-469
prim	-470
append	-471
points	-472
▁▁▁▁▁▁▁▁▁▁	-473
only	-474
them	-475
This	-476
sk	-477
oper	-478
tri	-479
zero	-480
Co	-481
ary	-482
▁since	-483
▁())	-484
remaining	-485
ag	-486
bin	-487
work	-488
io	-489
sequence	-490
cle	-491
cho	-492
map	-493
over	-494
ener	-495
umn	-496
wait	-497
imp	-498
cand	-499
odd	-500
▁',	-501
column	-502
gment	-503
Input	-504
yth	-505
ori	-506
sm	-507
last	-508
will	-509
query	-510
ython	-511
present	-512
distance	-513
based	-514
interval	-515
stra	-516
ated	-517
Which	-518
ise	-519
candid	-520
comes	-521
day	-522
split	-523
segment	-524
digits	-525
match	-526
▁j	-527
they	-528
maybe	-529
ction	-530
size	-531
inclu	-532
non	-533
equal	-534
Re	-535
ass	-536
root	-537
▁().	-538
vert	-539
conne	-540
hand	-541
Out	-542
Ano	-543
Another	-544
ite	-545
large	-546
Output	-547
connect	-548
``	-549
ition	-550
gener	-551
fici	-552
perm	-553
llow	-554
ffici	-555
child	-556
sing	-557
Che	-558
par	-559
follow	-560
take	-561
Thus	-562
track	-563
fficient	-564
pi	-565
ign	-566
ang	-567
cord	-568
model	-569
fore	-570
aph	-571
ong	-572
character	-573
▁d	-574
graph	-575
multip	-576
Check	-577
different	-578
divis	-579
becomes	-580
get	-581
processing	-582
def	-583
mask	-584
these	-585
pare	-586
key	-587
ious	-588
subset	-589
...	-590
ok	-591
lock	-592
prod	-593
consi	-594
cording	-595
mov	-596
permut	-597
gh	-598
ues	-599
component	-600
▁m	-601
sy	-602
//	-603
bit	-604
say	-605
using	-606
rever	-607
yes	-608
parent	-609
previous	-610
ever	-611
three	-612
ible	-613
could	-614
cells	-615
Python	-616
according	-617
straint	-618
exact	-619
Read	-620
result	-621
cycle	-622
conta	-623
Comp	-624
required	-625
av	-626
high	-627
fact	-628
age	-629
exist	-630
No	-631
▁split	-632
product	-633
counts	-634
▁c	-635
again	-636
color	-637
idx	-638
bu	-639
cases	-640
cre	-641
cut	-642
efficient	-643
play	-644
mm	-645
characters	-646
select	-647
contri	-648
does	-649
rence	-650
ure	-651
least	-652
exactly	-653
ol	-654
handle	-655
choose	-656
straints	-657
Each	-658
sel	-659
connected	-660
ize	-661
ant	-662
both	-663
solut	-664
contribut	-665
reak	-666
Compute	-667
ies	-668
ses	-669
like	-670
ird	-671
Hmm	-672
ally	-673
grid	-674
ail	-675
lines	-676
Tr	-677
▁_{	-678
termin	-679
sw	-680
digit	-681
ear	-682
▁)/	-683
dep	-684
der	-685
less	-686
block	-687
delta	-688
We	-689
integer	-690
values	-691
self	-692
How	-693
indi	-694
ile	-695
once	-696
direction	-697
reach	-698
those	-699
cont	-700
est	-701
constraints	-702
go	-703
allowed	-704
break	-705
quare	-706
ceed	-707
solution	-708
about	-709
adjac	-710
[]	-711
wr	-712
True	-713
prime	-714
emp	-715
mer	-716
Yes	-717
square	-718
trans	-719
struct	-720
vi	-721
!=	-722
substring	-723
operations	-724
candidate	-725
times	-726
gers	-727
oc	-728
ends	-729
fl	-730
wise	-731
mid	-732
gives	-733
determin	-734
ating	-735
▁N	-736
visit	-737
because	-738
matches	-739
proces	-740
uring	-741
imil	-742
imilar	-743
▁p	-744
permutation	-745
optim	-746
integers	-747
sys	-748
▁▁▁▁▁▁▁▁▁▁▁▁▁▁	-749
▁▁▁▁▁▁▁▁▁	-750
gre	-751
multiple	-752
starting	-753
comput	-754
flo	-755
statement	-756
now	-757
says	-758
ting	-759
represent	-760
assign	-761
dy	-762
more	-763
consider	-764
empty	-765
third	-766
own	-767
alle	-768
▁A	-769
gori	-770
man	-771
before	-772
combin	-773
added	-774
best	-775
▁▁▁▁▁	-776
loop	-777
ugh	-778
arget	-779
cep	-780
chan	-781
gorith	-782
processed	-783
algorith	-784
OR	-785
target	-786
while	-787
ace	-788
ied	-789
First	-790
adding	-791
collect	-792
ata	-793
four	-794
generate	-795
algorithm	-796
what	-797
ossible	-798
minimum	-799
used	-800
iter	-801
visited	-802
starts	-803
rows	-804
itions	-805
contin	-806
data	-807
children	-808
exp	-809
dea	-810
▁'.	-811
conse	-812
cutive	-813
lead	-814
ari	-815
tak	-816
OD	-817
▁]:	-818
consecutive	-819
seems	-820
ding	-821
single	-822
ice	-823
during	-824
However	-825
lar	-826
alse	-827
iz	-828
contains	-829
mplement	-830
indices	-831
occur	-832
MOD	-833
import	-834
cal	-835
heap	-836
rough	-837
ither	-838
fun	-839
enti	-840
▁..	-841
(-	-842
moving	-843
primes	-844
found	-845
incre	-846
binary	-847
through	-848
small	-849
lower	-850
asing	-851
angle	-852
etc	-853
'.	-854
moves	-855
ighb	-856
sure	-857
cul	-858
tract	-859
stack	-860
FS	-861
Sample	-862
upd	-863
continue	-864
larger	-865
ev	-866
```	-867
neighb	-868
adjacent	-869
uni	-870
False	-871
allest	-872
neg	-873
▁think	-874
vers	-875
type	-876
▁)]	-877
queue	-878
another	-879
▁//	-880
DP	-881
parts	-882
den	-883
feas	-884
top	-885
Since	-886
ss	-887
▁')	-888
▁y	-889
run	-890
feasible	-891
smallest	-892
lse	-893
efficiently	-894
tion	-895
lic	-896
ged	-897
requires	-898
intervals	-899
also	-900
ending	-901
ho	-902
▁('	-903
ailable	-904
To	-905
player	-906
▁the	-907
entire	-908
overl	-909
wind	-910
ob	-911
rot	-912
impossible	-913
reg	-914
ities	-915
▁r	-916
plan	-917
Pro	-918
either	-919
many	-920
proceed	-921
ters	-922
down	-923
vid	-924
▁*(	-925
function	-926
ptr	-927
manage	-928
Or	-929
formul	-930
condition	-931
flip	-932
was	-933
word	-934
ical	-935
available	-936
unique	-937
br	-938
▁|	-939
ready	-940
back	-941
window	-942
formula	-943
works	-944
exists	-945
groups	-946
imilarly	-947
bits	-948
inf	-949
already	-950
sq	-951
suf	-952
reverse	-953
std	-954
diff	-955
ill	-956
ency	-957
tain	-958
XOR	-959
▁)=	-960
redu	-961
invalid	-962
bil	-963
There	-964
plus	-965
operation	-966
build	-967
Else	-968
▁t	-969
vel	-970
sums	-971
pat	-972
optimal	-973
most	-974
suffix	-975
cent	-976
side	-977
matri	-978
cnt	-979
BFS	-980
▁l	-981
ward	-982
▁from	-983
higher	-984
allows	-985
table	-986
gest	-987
Similarly	-988
dered	-989
depth	-990
stdin	-991
subtract	-992
Other	-993
arch	-994
round	-995
fect	-996
▁if	-997
manageable	-998
bl	-999
candidates	-1000
pattern	-1001
positive	-1002
Initial	-1003
fter	-1004
gram	-1005
cl	-1006
columns	-1007
▁sum	-1008
After	-1009
log	-1010
largest	-1011
negative	-1012
inv	-1013
card	-1014
doesn	-1015
cd	-1016
weight	-1017
matrix	-1018
__	-1019
might	-1020
▁("	-1021
rt	-1022
place	-1023
ways	-1024
',	-1025
structure	-1026
difference	-1027
plac	-1028
An	-1029
▁)*	-1030
▁which	-1031
dec	-1032
ator	-1033
segments	-1034
ater	-1035
deg	-1036
queries	-1037
dx	-1038
exponent	-1039
arrange	-1040
subtree	-1041
bot	-1042
look	-1043
pose	-1044
states	-1045
paths	-1046
Process	-1047
idea	-1048
▁→	-1049
isect	-1050
cer	-1051
implement	-1052
Ex	-1053
spa	-1054
dis	-1055
level	-1056
bal	-1057
ens	-1058
Otherwise	-1059
follows	-1060
thing	-1061
mon	-1062
▁<	-1063
days	-1064
bisect	-1065
search	-1066
lea	-1067
On	-1068
calcul	-1069
▁")	-1070
ices	-1071
ones	-1072
inct	-1073
desc	-1074
parity	-1075
poly	-1076
strip	-1077
degree	-1078
ES	-1079
needed	-1080
St	-1081
cir	-1082
better	-1083
distinct	-1084
...,	-1085
cles	-1086
sto	-1087
term	-1088
stand	-1089
certain	-1090
make	-1091
spe	-1092
cept	-1093
stu	-1094
terms	-1095
▁.,	-1096
earli	-1097
▁!	-1098
ual	-1099
increa	-1100
ents	-1101
leading	-1102
ake	-1103
clo	-1104
program	-1105
YES	-1106
ross	-1107
correctly	-1108
sive	-1109
▁v	-1110
That	-1111
▁u	-1112
inser	-1113
gcd	-1114
reversed	-1115
precompute	-1116
Sum	-1117
upper	-1118
include	-1119
ful	-1120
Initialize	-1121
area	-1122
floor	-1123
▁':	-1124
divisors	-1125
fr	-1126
considering	-1127
iv	-1128
pop	-1129
road	-1130
vari	-1131
multi	-1132
change	-1133
cover	-1134
▁²	-1135
components	-1136
itt	-1137
sqrt	-1138
moved	-1139
▁__	-1140
ti	-1141
chain	-1142
update	-1143
apping	-1144
whe	-1145
sp	-1146
colors	-1147
computed	-1148
Ad	-1149
uses	-1150
trip	-1151
ai	-1152
whether	-1153
▁".	-1154
None	-1155
plied	-1156
possi	-1157
interse	-1158
sat	-1159
pect	-1160
mis	-1161
),	-1162
swap	-1163
zeros	-1164
pon	-1165
old	-1166
om	-1167
oriz	-1168
within	-1169
vertical	-1170
Therefore	-1171
except	-1172
checking	-1173
ming	-1174
satis	-1175
base	-1176
ush	-1177
why	-1178
variable	-1179
Once	-1180
cap	-1181
divid	-1182
determined	-1183
our	-1184
know	-1185
selected	-1186
create	-1187
team	-1188
pal	-1189
Find	-1190
increasing	-1191
following	-1192
occurrence	-1193
needs	-1194
letters	-1195
led	-1196
vered	-1197
covered	-1198
▁)^	-1199
coord	-1200
respon	-1201
until	-1202
▁▁▁▁▁▁▁▁▁▁▁▁▁	-1203
fri	-1204
dict	-1205
remove	-1206
contain	-1207
ks	-1208
win	-1209
itten	-1210
Se	-1211
written	-1212
▁()))	-1213
gon	-1214
▁L	-1215
CD	-1216
strings	-1217
▁B	-1218
ift	-1219
ry	-1220
lon	-1221
final	-1222
palind	-1223
separ	-1224
rest	-1225
divisible	-1226
placed	-1227
▁S	-1228
sug	-1229
▁",	-1230
neighbor	-1231
incorrect	-1232
subarray	-1233
try	-1234
hel	-1235
pass	-1236
rences	-1237
merged	-1238
req	-1239
suggest	-1240
rem	-1241
too	-1242
polygon	-1243
Cor	-1244
When	-1245
readline	-1246
tra	-1247
existing	-1248
factors	-1249
▁]=	-1250
perform	-1251
edi	-1252
cycles	-1253
without	-1254
Example	-1255
cons	-1256
Add	-1257
leaves	-1258
orizon	-1259
considered	-1260
exit	-1261
conf	-1262
includes	-1263
coordin	-1264
subsets	-1265
Correct	-1266
▁D	-1267
lex	-1268
contribution	-1269
suggests	-1270
horizon	-1271
ser	-1272
**	-1273
ough	-1274
determine	-1275
decre	-1276
reduces	-1277
nam	-1278
mar	-1279
LC	-1280
</	-1281
Sort	-1282
ceil	-1283
space	-1284
returns	-1285
frequ	-1286
kay	-1287
ized	-1288
▁((	-1289
affect	-1290
▁python	-1291
▁ab	-1292
comple	-1293
bos	-1294
tre	-1295
diction	-1296
clu	-1297
Okay	-1298
ced	-1299
GCD	-1300
▁current	-1301
deque	-1302
▁eos	-1303
recur	-1304
NO	-1305
smaller	-1306
fixed	-1307
removed	-1308
game	-1309
ping	-1310
formed	-1311
require	-1312
adi	-1313
via	-1314
vect	-1315
horizontal	-1316
imize	-1317
▁^{	-1318
##	-1319
▁']	-1320
ences	-1321
▁like	-1322
▁inf	-1323
long	-1324
ants	-1325
math	-1326
finding	-1327
assum	-1328
changes	-1329
elif	-1330
followed	-1331
▁max	-1332
others	-1333
temp	-1334
pow	-1335
▁**	-1336
including	-1337
ru	-1338
programming	-1339
vertices	-1340
done	-1341
movement	-1342
rectangle	-1343
modul	-1344
solve	-1345
being	-1346
Sup	-1347
transitions	-1348
Suppose	-1349
overlapping	-1350
increment	-1351
conditions	-1352
stud	-1353
Second	-1354
Con	-1355
cross	-1356
hash	-1357
conv	-1358
modif	-1359
shift	-1360
accep	-1361
eve	-1362
greater	-1363
▁;	-1364
▁but	-1365
contributes	-1366
permutations	-1367
sequences	-1368
correspon	-1369
neighbors	-1370
sets	-1371
acceptable	-1372
It	-1373
exceed	-1374
bility	-1375
▁strip	-1376
All	-1377
freq	-1378
skip	-1379
black	-1380
far	-1381
proba	-1382
just	-1383
directions	-1384
box	-1385
sco	-1386
triplet	-1387
consist	-1388
mak	-1389
every	-1390
-=	-1391
▁C	-1392
medi	-1393
option	-1394
come	-1395
his	-1396
bound	-1397
under	-1398
dle	-1399
ped	-1400
Processing	-1401
dictionary	-1402
decreasing	-1403
oin	-1404
white	-1405
tas	-1406
remains	-1407
been	-1408
actual	-1409
▁():	-1410
Pre	-1411
ner	-1412
Ah	-1413
takes	-1414
minus	-1415
multiplied	-1416
expect	-1417
He	-1418
hal	-1419
increases	-1420
tom	-1421
▁}.	-1422
building	-1423
cards	-1424
rome	-1425
maind	-1426
substrings	-1427
la	-1428
logi	-1429
lay	-1430
wrong	-1431
city	-1432
ess	-1433
▁R	-1434
')	-1435
remaind	-1436
arran	-1437
palindrome	-1438
abo	-1439
ste	-1440
complic	-1441
Test	-1442
sion	-1443
float	-1444
balance	-1445
necess	-1446
middle	-1447
blocks	-1448
At	-1449
forward	-1450
rank	-1451
mist	-1452
deno	-1453
Not	-1454
convex	-1455
ning	-1456
xi	-1457
replace	-1458
ranges	-1459
bottom	-1460
ick	-1461
sc	-1462
iterate	-1463
very	-1464
similar	-1465
bilities	-1466
short	-1467
Also	-1468
standard	-1469
lim	-1470
union	-1471
wins	-1472
flow	-1473
circle	-1474
adjust	-1475
help	-1476
Row	-1477
items	-1478
▁h	-1479
cu	-1480
aa	-1481
depends	-1482
osen	-1483
And	-1484
brid	-1485
▁[-	-1486
above	-1487
power	-1488
intersection	-1489
achi	-1490
chosen	-1491
vertex	-1492
squares	-1493
tup	-1494
grees	-1495
earliest	-1496
je	-1497
ax	-1498
words	-1499
sup	-1500
exclu	-1501
apply	-1502
runs	-1503
degrees	-1504
height	-1505
matching	-1506
frequency	-1507
combinations	-1508
keep	-1509
don	-1510
multiply	-1511
modulo	-1512
swaps	-1513
▁w	-1514
name	-1515
call	-1516
arrangement	-1517
mistake	-1518
son	-1519
remainder	-1520
note	-1521
adjacency	-1522
format	-1523
variables	-1524
uplic	-1525
▁▁▁▁▁▁▁▁▁▁▁▁	-1526
appear	-1527
▁},	-1528
mage	-1529
ded	-1530
center	-1531
▁so	-1532
Total	-1533
along	-1534
she	-1535
delet	-1536
mand	-1537
tions	-1538
agon	-1539
overlap	-1540
combination	-1541
assigned	-1542
still	-1543
ump	-1544
▁join	-1545
cat	-1546
adds	-1547
ets	-1548
ine	-1549
half	-1550
fit	-1551
ak	-1552
her	-1553
fil	-1554
sieve	-1555
convert	-1556
car	-1557
spl	-1558
pick	-1559
arranged	-1560
AB	-1561
arri	-1562
<<	-1563
ilt	-1564
ull	-1565
ances	-1566
sign	-1567
pie	-1568
splits	-1569
▁]*	-1570
ries	-1571
coordinates	-1572
py	-1573
partic	-1574
▁->	-1575
inside	-1576
▁f	-1577
ving	-1578
ase	-1579
ging	-1580
namic	-1581
ij	-1582
uch	-1583
divisor	-1584
da	-1585
cum	-1586
subsequence	-1587
ball	-1588
possibilities	-1589
May	-1590
common	-1591
lists	-1592
among	-1593
slow	-1594
hold	-1595
merge	-1596
duplic	-1597
my	-1598
examples	-1599
abs	-1600
events	-1601
descending	-1602
person	-1603
Step	-1604
bi	-1605
bid	-1606
lengths	-1607
dynamic	-1608
getting	-1609
hest	-1610
ighest	-1611
dataset	-1612
ish	-1613
tack	-1614
Maybe	-1615
ory	-1616
Idea	-1617
You	-1618
Lo	-1619
straight	-1620
taken	-1621
Gi	-1622
ef	-1623
mark	-1624
ault	-1625
).	-1626
nor	-1627
give	-1628
ameter	-1629
around	-1630
curr	-1631
Per	-1632
▁for	-1633
shortest	-1634
▁append	-1635
happ	-1636
compare	-1637
contribute	-1638
pha	-1639
default	-1640
trees	-1641
exponents	-1642
action	-1643
ya	-1644
sufficient	-1645
calculate	-1646
divided	-1647
Given	-1648
angles	-1649
Precompute	-1650
bly	-1651
roads	-1652
▁M	-1653
Pr	-1654
▁count	-1655
equals	-1656
taking	-1657
built	-1658
dr	-1659
ority	-1660
....	-1661
ipart	-1662
highest	-1663
ror	-1664
vide	-1665
bipart	-1666
true	-1667
▁,-	-1668
verse	-1669
represented	-1670
▁each	-1671
score	-1672
Li	-1673
players	-1674
event	-1675
aut	-1676
earlier	-1677
▁number	-1678
limit	-1679
ired	-1680
jump	-1681
entries	-1682
off	-1683
always	-1684
oid	-1685
satisfi	-1686
Next	-1687
equation	-1688
chal	-1689
coins	-1690
▁name	-1691
▁%	-1692
ph	-1693
invol	-1694
cities	-1695
ls	-1696
als	-1697
land	-1698
▁new	-1699
cky	-1700
Note	-1701
domin	-1702
▁]]	-1703
gu	-1704
good	-1705
expected	-1706
construct	-1707
leaf	-1708
hull	-1709
ject	-1710
ous	-1711
rotation	-1712
pri	-1713
complicated	-1714
▁X	-1715
iva	-1716
denomin	-1717
friends	-1718
distances	-1719
board	-1720
show	-1721
achiev	-1722
Alice	-1723
something	-1724
close	-1725
Original	-1726
checks	-1727
infin	-1728
equiva	-1729
generating	-1730
real	-1731
IN	-1732
tok	-1733
wick	-1734
expres	-1735
enwick	-1736
['	-1737
ments	-1738
fy	-1739
Examples	-1740
▁in	-1741
region	-1742
probability	-1743
active	-1744
radi	-1745
diagon	-1746
made	-1747
▁[:	-1748
complex	-1749
directed	-1750
known	-1751
▁main	-1752
▁?),	-1753
logic	-1754
task	-1755
options	-1756
scen	-1757
represents	-1758
->	-1759
store	-1760
bidden	-1761
ordered	-1762
command	-1763
missing	-1764
insert	-1765
defaultdict	-1766
Third	-1767
satisfy	-1768
Col	-1769
ved	-1770
isn	-1771
diameter	-1772
blocked	-1773
ling	-1774
full	-1775
differences	-1776
▁:]	-1777
leq	-1778
▁...	-1779
Print	-1780
mem	-1781
room	-1782
friend	-1783
solute	-1784
gap	-1785
▁','	-1786
air	-1787
'(	-1788
quest	-1789
rat	-1790
decimal	-1791
cumul	-1792
removing	-1793
capac	-1794
▁left	-1795
much	-1796
buy	-1797
enough	-1798
Oh	-1799
rel	-1800
port	-1801
▁even	-1802
':	-1803
generated	-1804
separated	-1805
lent	-1806
ds	-1807
free	-1808
forbidden	-1809
absolute	-1810
reachable	-1811
Tree	-1812
maximize	-1813
modified	-1814
avoid	-1815
gain	-1816
ime	-1817
inputs	-1818
Fenwick	-1819
dest	-1820
ople	-1821
ular	-1822
chang	-1823
▁(-	-1824
ctions	-1825
▁th	-1826
fourth	-1827
▁NO	-1828
filled	-1829
Bob	-1830
entry	-1831
▁)-	-1832
stored	-1833
ont	-1834
vector	-1835
stop	-1836
ier	-1837
people	-1838
ensure	-1839
merging	-1840
xor	-1841
factor	-1842
▁/(	-1843
push	-1844
att	-1845
cannot	-1846
asc	-1847
▁T	-1848
directly	-1849
transition	-1850
Case	-1851
assuming	-1852
osing	-1853
planation	-1854
equivalent	-1855
itially	-1856
▁)//	-1857
achieved	-1858
Gener	-1859
LCM	-1860
linear	-1861
▁)).	-1862
ario	-1863
year	-1864
were	-1865
triangle	-1866
▁=-	-1867
altern	-1868
Testing	-1869
duplicates	-1870
":	-1871
regard	-1872
Perhaps	-1873
front	-1874
▁K	-1875
ascending	-1876
longer	-1877
fail	-1878
undy	-1879
recursive	-1880
ts	-1881
copy	-1882
none	-1883
Count	-1884
longest	-1885
understand	-1886
aw	-1887
yi	-1888
"__	-1889
mi	-1890
separate	-1891
choice	-1892
median	-1893
arrays	-1894
((	-1895
robot	-1896
regardless	-1897
Generate	-1898
gy	-1899
▁__":	-1900
▁)),	-1901
pes	-1902
DS	-1903
open	-1904
stri	-1905
students	-1906
goal	-1907
ings	-1908
ys	-1909
priority	-1910
counted	-1911
bas	-1912
▁original	-1913
write	-1914
wards	-1915
carr	-1916
▁g	-1917
ub	-1918
bridge	-1919
necessary	-1920
memo	-1921
ision	-1922
decrea	-1923
ization	-1924
particip	-1925
divide	-1926
scenario	-1927
ST	-1928
aran	-1929
vs	-1930
repe	-1931
date	-1932
choosing	-1933
division	-1934
wall	-1935
▁index	-1936
usion	-1937
Ed	-1938
corresponding	-1939
occurrences	-1940
arante	-1941
ats	-1942
guarante	-1943
▁no	-1944
dir	-1945
suppose	-1946
ars	-1947
▁z	-1948
want	-1949
numer	-1950
makes	-1951
tuple	-1952
cr	-1953
version	-1954
attack	-1955
paint	-1956
sid	-1957
sorting	-1958
covers	-1959
))	-1960
capacity	-1961
collections	-1962
sour	-1963
computation	-1964
big	-1965
coefficient	-1966
layer	-1967
mount	-1968
denominator	-1969
letter	-1970
cube	-1971
siz	-1972
regions	-1973
aces	-1974
▁]*(	-1975
station	-1976
iteration	-1977
defin	-1978
heapq	-1979
multiples	-1980
masks	-1981
tracking	-1982
▁leq	-1983
stor	-1984
resid	-1985
bipartite	-1986
keys	-1987
cies	-1988
wice	-1989
▁)):	-1990
imized	-1991
edy	-1992
computing	-1993
compos	-1994
'?	-1995
trail	-1996
alternative	-1997
though	-1998
vectors	-1999
kn	-2000
wn	-2001
uous	-2002
placing	-2003
UT	-2004
hit	-2005
outputs	-2006
versal	-2007
ically	-2008
domino	-2009
train	-2010
lict	-2011
imul	-2012
item	-2013
theta	-2014
mex	-2015
twice	-2016
Mo	-2017
selecting	-2018
itself	-2019
met	-2020
minimize	-2021
▁}^	-2022
cial	-2023
differ	-2024
student	-2025
carry	-2026
▁up	-2027
across	-2028
asses	-2029
multipl	-2030
▁after	-2031
intain	-2032
▁including	-2033
Like	-2034
ures	-2035
conflict	-2036
applied	-2037
who	-2038
pile	-2039
sizes	-2040
DSU	-2041
greedy	-2042
possibly	-2043
ond	-2044
guaranteed	-2045
wid	-2046
lete	-2047
Implement	-2048
arrival	-2049
traversal	-2050
inclusive	-2051
worst	-2052
[(	-2053
rib	-2054
comb	-2055
question	-2056
happen	-2057
ages	-2058
weights	-2059
flips	-2060
▁YES	-2061
going	-2062
utes	-2063
aver	-2064
What	-2065
types	-2066
▁as	-2067
lies	-2068
▁or	-2069
diagonal	-2070
factori	-2071
pend	-2072
okay	-2073
[-	-2074
means	-2075
rotated	-2076
king	-2077
included	-2078
gether	-2079
addition	-2080
delete	-2081
together	-2082
share	-2083
▁$	-2084
ima	-2085
class	-2086
handling	-2087
▁distance	-2088
straightforward	-2089
face	-2090
ify	-2091
Collect	-2092
strict	-2093
fic	-2094
gg	-2095
reate	-2096
lucky	-2097
sl	-2098
coll	-2099
gaps	-2100
stones	-2101
As	-2102
clock	-2103
▁P	-2104
▁)))	-2105
blue	-2106
maintain	-2107
syste	-2108
▁odd	-2109
spaces	-2110
▁cost	-2111
▁]).	-2112
brack	-2113
arily	-2114
excluding	-2115
fer	-2116
▁W	-2117
counter	-2118
parse	-2119
inserting	-2120
general	-2121
".	-2122
combined	-2123
handled	-2124
arter	-2125
fill	-2126
appears	-2127
amount	-2128
ately	-2129
Create	-2130
stuck	-2131
consists	-2132
simul	-2133
LCA	-2134
trailing	-2135
seconds	-2136
Take	-2137
width	-2138
ption	-2139
Fi	-2140
Bu	-2141
▁."	-2142
increase	-2143
indic	-2144
respect	-2145
Start	-2146
radius	-2147
smarter	-2148
assignment	-2149
price	-2150
wants	-2151
ny	-2152
▁No	-2153
desired	-2154
▁assuming	-2155
{}	-2156
'.'	-2157
cli	-2158
basis	-2159
divides	-2160
▁min	-2161
lowercase	-2162
▁o	-2163
fs	-2164
splitting	-2165
sequent	-2166
partition	-2167
▁H	-2168
Po	-2169
▁]))	-2170
flipping	-2171
head	-2172
proper	-2173
ended	-2174
LE	-2175
sym	-2176
error	-2177
ank	-2178
adjusted	-2179
▁start	-2180
meth	-2181
intersect	-2182
otherwise	-2183
pointer	-2184
describ	-2185
overall	-2186
mir	-2187
occurs	-2188
outside	-2189
eas	-2190
method	-2191
Look	-2192
▁^(	-2193
span	-2194
shows	-2195
subsequent	-2196
grundy	-2197
cro	-2198
sa	-2199
containing	-2200
perime	-2201
▁length	-2202
formation	-2203
user	-2204
applying	-2205
challen	-2206
otes	-2207
explanation	-2208
cks	-2209
spec	-2210
strictly	-2211
clockwise	-2212
▁dx	-2213
quick	-2214
system	-2215
updated	-2216
post	-2217
caten	-2218
itch	-2219
pract	-2220
opposit	-2221
labe	-2222
ni	-2223
boxes	-2224
--	-2225
making	-2226
DFS	-2227
ye	-2228
imin	-2229
average	-2230
compar	-2231
lobal	-2232
'#	-2233
uth	-2234
MP	-2235
clear	-2236
book	-2237
peri	-2238
Build	-2239
against	-2240
[[	-2241
piece	-2242
affects	-2243
perimeter	-2244
forms	-2245
ensive	-2246
circles	-2247
roots	-2248
ked	-2249
coordinate	-2250
respective	-2251
▁right	-2252
opposite	-2253
Vas	-2254
strate	-2255
challenge	-2256
ND	-2257
necessarily	-2258
outline	-2259
numerator	-2260
distri	-2261
choices	-2262
units	-2263
concaten	-2264
him	-2265
source	-2266
infinity	-2267
▁all	-2268
Up	-2269
MST	-2270
cup	-2271
phase	-2272
bey	-2273
ratio	-2274
stit	-2275
encies	-2276
global	-2277
Fib	-2278
beyond	-2279
appl	-2280
norm	-2281
▁['	-2282
SA	-2283
implementing	-2284
simp	-2285
ons	-2286
resulting	-2287
minutes	-2288
Looking	-2289
teams	-2290
fur	-2291
illion	-2292
pieces	-2293
costs	-2294
practice	-2295
De	-2296
speed	-2297
implies	-2298
saf	-2299
sur	-2300
satisfied	-2301
tokens	-2302
dim	-2303
quickly	-2304
individ	-2305
capt	-2306
ident	-2307
pot	-2308
specif	-2309
'-	-2310
become	-2311
contr	-2312
triplets	-2313
▁q	-2314
stead	-2315
image	-2316
contig	-2317
town	-2318
Split	-2319
rotations	-2320
insertion	-2321
contiguous	-2322
below	-2323
fin	-2324
strategy	-2325
inverse	-2326
Possible	-2327
member	-2328
tuples	-2329
ights	-2330
rectangles	-2331
auto	-2332
ered	-2333
Edge	-2334
swapping	-2335
care	-2336
Sub	-2337
▁row	-2338
unless	-2339
exceeds	-2340
squared	-2341
contradi	-2342
▁len	-2343
'+	-2344
stac	-2345
▁not	-2346
closest	-2347
popleft	-2348
fue	-2349
Constraints	-2350
meet	-2351
names	-2352
pen	-2353
▁E	-2354
mess	-2355
suming	-2356
ense	-2357
▁)+	-2358
leftmost	-2359
depend	-2360
switch	-2361
fully	-2362
AG	-2363
layers	-2364
obstac	-2365
Use	-2366
amb	-2367
tail	-2368
yet	-2369
described	-2370
independ	-2371
[[]	-2372
atch	-2373
problems	-2374
independent	-2375
automat	-2376
dimens	-2377
bad	-2378
east	-2379
vary	-2380
million	-2381
reduce	-2382
ambda	-2383
vol	-2384
leads	-2385
bridges	-2386
substit	-2387
▁<=	-2388
pack	-2389
cumulative	-2390
cm	-2391
rules	-2392
AA	-2393
period	-2394
Here	-2395
Bo	-2396
nothing	-2397
ted	-2398
lambda	-2399
coverage	-2400
star	-2401
transformed	-2402
gir	-2403
whose	-2404
Vasya	-2405
odds	-2406
ijk	-2407
wers	-2408
palindrom	-2409
passes	-2410
igno	-2411
hero	-2412
fraction	-2413
subarrays	-2414
▁})	-2415
checked	-2416
net	-2417
hy	-2418
INF	-2419
bus	-2420
complete	-2421
matter	-2422
zy	-2423
alpha	-2424
satisfies	-2425
lls	-2426
ifth	-2427
eat	-2428
corresponds	-2429
leave	-2430
flipped	-2431
mean	-2432
amp	-2433
individual	-2434
profit	-2435
safe	-2436
maximal	-2437
imiz	-2438
effect	-2439
fuel	-2440
balls	-2441
▁([	-2442
ew	-2443
ship	-2444
house	-2445
Max	-2446
ured	-2447
loye	-2448
equations	-2449
calculation	-2450
▁with	-2451
vation	-2452
loops	-2453
inary	-2454
Le	-2455
▁Yes	-2456
special	-2457
ually	-2458
bered	-2459
bs	-2460
ensu	-2461
reduced	-2462
Loop	-2463
▁abc	-2464
Ro	-2465
late	-2466
spf	-2467
turns	-2468
gets	-2469
jo	-2470
Man	-2471
beaut	-2472
umer	-2473
▁total	-2474
pay	-2475
understanding	-2476
distribut	-2477
Update	-2478
mode	-2479
▁positions	-2480
▁excluding	-2481
cular	-2482
holds	-2483
results	-2484
changing	-2485
simple	-2486
Iter	-2487
▁aba	-2488
gin	-2489
ki	-2490
multiplic	-2491
▁)/(	-2492
destin	-2493
aries	-2494
apped	-2495
elimin	-2496
obser	-2497
aving	-2498
spanning	-2499
togg	-2500
later	-2501
replaced	-2502
hour	-2503
numbered	-2504
unit	-2505
ssign	-2506
orig	-2507
chars	-2508
seen	-2509
axis	-2510
cuts	-2511
expl	-2512
Assign	-2513
tiles	-2514
bitmask	-2515
▁)(	-2516
▁False	-2517
solutions	-2518
IT	-2519
north	-2520
AND	-2521
computationally	-2522
fig	-2523
quad	-2524
further	-2525
looking	-2526
sides	-2527
sense	-2528
▁G	-2529
coefficients	-2530
west	-2531
endpoints	-2532
wal	-2533
constraint	-2534
phi	-2535
ops	-2536
CC	-2537
pan	-2538
hatt	-2539
hattan	-2540
PUT	-2541
rev	-2542
minimized	-2543
coprime	-2544
cros	-2545
▁pos	-2546
▁sort	-2547
shifted	-2548
monst	-2549
Node	-2550
actions	-2551
prob	-2552
lif	-2553
collected	-2554
substitut	-2555
updates	-2556
Un	-2557
▁node	-2558
enumer	-2559
gs	-2560
oms	-2561
challeng	-2562
selection	-2563
rece	-2564
winner	-2565
els	-2566
▁[(	-2567
ensures	-2568
stone	-2569
ites	-2570
Di	-2571
closed	-2572
prec	-2573
=-	-2574
contest	-2575
amin	-2576
ref	-2577
rip	-2578
Iterate	-2579
logical	-2580
alcul	-2581
employe	-2582
token	-2583
activ	-2584
▁`	-2585
Ch	-2586
your	-2587
▁**:	-2588
stick	-2589
Ap	-2590
These	-2591
ld	-2592
lot	-2593
song	-2594
hi	-2595
thus	-2596
")	-2597
text	-2598
compres	-2599
well	-2600
tile	-2601
normal	-2602
infinite	-2603
won	-2604
cos	-2605
▁position	-2606
config	-2607
Calcul	-2608
ators	-2609
insight	-2610
shap	-2611
▁step	-2612
ranch	-2613
▁)*(	-2614
bc	-2615
ensuring	-2616
dish	-2617
stations	-2618
pired	-2619
levels	-2620
month	-2621
ners	-2622
Manhattan	-2623
marked	-2624
products	-2625
ames	-2626
descrip	-2627
pur	-2628
bitr	-2629
initially	-2630
tight	-2631
changed	-2632
uration	-2633
ijkstra	-2634
arbitr	-2635
gues	-2636
trie	-2637
counting	-2638
Hence	-2639
rooms	-2640
inversion	-2641
solved	-2642
▁F	-2643
processes	-2644
complement	-2645
challenging	-2646
▁aa	-2647
multis	-2648
One	-2649
rook	-2650
complexity	-2651
accumul	-2652
recursively	-2653
clusion	-2654
branch	-2655
rightmost	-2656
consisting	-2657
Dijkstra	-2658
instead	-2659
observation	-2660
cust	-2661
towards	-2662
six	-2663
recursion	-2664
patterns	-2665
expression	-2666
alled	-2667
operator	-2668
helpful	-2669
damage	-2670
draw	-2671
versions	-2672
decreases	-2673
ial	-2674
putting	-2675
▁sorted	-2676
ols	-2677
ule	-2678
few	-2679
tric	-2680
iding	-2681
likely	-2682
assume	-2683
backward	-2684
thest	-2685
connects	-2686
produ	-2687
defined	-2688
contributions	-2689
combining	-2690
Initially	-2691
colo	-2692
ash	-2693
issu	-2694
begin	-2695
obtain	-2696
▁to	-2697
subtracting	-2698
▁]),	-2699
DAG	-2700
MPLE	-2701
inspired	-2702
▁)].	-2703
memoization	-2704
",	-2705
anced	-2706
▁next	-2707
mapping	-2708
gru	-2709
valu	-2710
functions	-2711
eld	-2712
fifth	-2713
kes	-2714
congru	-2715
pies	-2716
vided	-2717
stay	-2718
nx	-2719
topo	-2720
inner	-2721
expensive	-2722
suc	-2723
due	-2724
samples	-2725
SAMPLE	-2726
orient	-2727
swapped	-2728
centers	-2729
ra	-2730
aper	-2731
decid	-2732
memory	-2733
called	-2734
coin	-2735
ponent	-2736
{'	-2737
undirected	-2738
ept	-2739
roid	-2740
].	-2741
goes	-2742
mirror	-2743
participants	-2744
appush	-2745
heappush	-2746
sin	-2747
increments	-2748
piles	-2749
qrt	-2750
destination	-2751
Ar	-2752
▁').	-2753
record	-2754
immedi	-2755
▁I	-2756
recurrence	-2757
flag	-2758
gth	-2759
inally	-2760
express	-2761
oney	-2762
kept	-2763
colored	-2764
ancestor	-2765
carefully	-2766
dou	-2767
butt	-2768
stops	-2769
fut	-2770
had	-2771
clic	-2772
depart	-2773
south	-2774
igned	-2775
easier	-2776
multiset	-2777
description	-2778
outcome	-2779
xy	-2780
gl	-2781
datasets	-2782
'(',	-2783
replacing	-2784
message	-2785
vice	-2786
places	-2787
respectively	-2788
Mult	-2789
answers	-2790
paired	-2791
var	-2792
reading	-2793
specific	-2794
bul	-2795
▁else	-2796
###	-2797
ameters	-2798
na	-2799
modify	-2800
▁self	-2801
tools	-2802
▁prefix	-2803
Move	-2804
ternal	-2805
inst	-2806
cub	-2807
enumerate	-2808
▁'),	-2809
Group	-2810
composite	-2811
parents	-2812
Qu	-2813
backtracking	-2814
frequencies	-2815
metric	-2816
ives	-2817
reas	-2818
bracket	-2819
calculated	-2820
reality	-2821
▁#	-2822
topological	-2823
imizes	-2824
iterating	-2825
remo	-2826
Multip	-2827
ark	-2828
Implementing	-2829
sn	-2830
Val	-2831
cket	-2832
Gr	-2833
Counter	-2834
▁without	-2835
participant	-2836
money	-2837
Calculate	-2838
vow	-2839
figure	-2840
bro	-2841
ived	-2842
representation	-2843
▁|.	-2844
orders	-2845
ps	-2846
winning	-2847
perfect	-2848
▁.)	-2849
involves	-2850
enter	-2851
sliding	-2852
calculating	-2853
fast	-2854
ken	-2855
handles	-2856
centroid	-2857
themat	-2858
opponent	-2859
closing	-2860
collision	-2861
ficult	-2862
ness	-2863
things	-2864
difficult	-2865
Well	-2866
decrease	-2867
'*	-2868
trying	-2869
commands	-2870
future	-2871
eff	-2872
arbitrary	-2873
precomputed	-2874
optimized	-2875
jumps	-2876
Option	-2877
matched	-2878
magi	-2879
removal	-2880
cially	-2881
inity	-2882
alternate	-2883
copies	-2884
Remove	-2885
zz	-2886
deleted	-2887
They	-2888
mathemat	-2889
AC	-2890
balanced	-2891
expand	-2892
five	-2893
▁ba	-2894
ched	-2895
minute	-2896
Multiply	-2897
lazy	-2898
additional	-2899
▁non	-2900
nomi	-2901
tails	-2902
itive	-2903
cour	-2904
iterations	-2905
chooses	-2906
Both	-2907
reaches	-2908
fib	-2909
painted	-2910
polynomi	-2911
stat	-2912
losing	-2913
information	-2914
▁]-	-2915
examin	-2916
important	-2917
stair	-2918
subtrees	-2919
Chef	-2920
denote	-2921
aj	-2922
En	-2923
assignments	-2924
anything	-2925
chains	-2926
force	-2927
reason	-2928
rule	-2929
▁size	-2930
modeled	-2931
asha	-2932
involve	-2933
orter	-2934
ID	-2935
▁=(	-2936
espe	-2937
occup	-2938
indicates	-2939
outgoing	-2940
deck	-2941
provided	-2942
guess	-2943
reflect	-2944
maj	-2945
▁same	-2946
ene	-2947
water	-2948
incl	-2949
Four	-2950
especially	-2951
▁O	-2952
pairwise	-2953
island	-2954
floating	-2955
tricky	-2956
loc	-2957
Quer	-2958
▁prev	-2959
inclusion	-2960
walls	-2961
oting	-2962
solving	-2963
deletions	-2964
arc	-2965
>>	-2966
AT	-2967
▁:.	-2968
arith	-2969
')',	-2970
▁starting	-2971
consuming	-2972
roy	-2973
accordingly	-2974
shot	-2975
▁ii	-2976
Ci	-2977
EF	-2978
soldi	-2979
etya	-2980
subsequences	-2981
sink	-2982
▁Y	-2983
rotate	-2984
capture	-2985
send	-2986
centr	-2987
bar	-2988
ane	-2989
plane	-2990
light	-2991
die	-2992
▁)}	-2993
optimize	-2994
BB	-2995
lang	-2996
joint	-2997
intended	-2998
success	-2999
anal	-3000
carp	-3001
Rep	-3002
hard	-3003
▁mask	-3004
men	-3005
iterative	-3006
▁	-3007
precision	-3008
()	-3009
Subtract	-3010
initialized	-3011
Convert	-3012
door	-3013
decided	-3014
away	-3015
ature	-3016
rooted	-3017
whenever	-3018
transform	-3019
dot	-3020
immediately	-3021
home	-3022
Ai	-3023
shorter	-3024
'?'	-3025
From	-3026
working	-3027
▁indices	-3028
examine	-3029
particular	-3030
abc	-3031
replacement	-3032
regular	-3033
evalu	-3034
shop	-3035
having	-3036
ties	-3037
subgraph	-3038
omer	-3039
probably	-3040
knight	-3041
indexes	-3042
▁\	-3043
converting	-3044
jects	-3045
covering	-3046
roll	-3047
disc	-3048
dete	-3049
leaving	-3050
hole	-3051
farthest	-3052
▁except	-3053
cide	-3054
girl	-3055
sched	-3056
coming	-3057
internal	-3058
▁low	-3059
faces	-3060
cts	-3061
batch	-3062
breaks	-3063
ctor	-3064
Right	-3065
uppercase	-3066
++	-3067
link	-3068
bipartition	-3069
Sorted	-3070
dominoes	-3071
bles	-3072
seats	-3073
decide	-3074
response	-3075
account	-3076
latest	-3077
'('	-3078
creating	-3079
rounds	-3080
conflicting	-3081
differently	-3082
core	-3083
era	-3084
shifts	-3085
slo	-3086
sever	-3087
Your	-3088
Poly	-3089
elev	-3090
▁infinity	-3091
appli	-3092
parameters	-3093
brackets	-3094
▁mod	-3095
Pos	-3096
scores	-3097
windows	-3098
comparing	-3099
candies	-3100
Set	-3101
corner	-3102
▁image	-3103
encount	-3104
residue	-3105
beginning	-3106
exponenti	-3107
exam	-3108
lace	-3109
ud	-3110
placement	-3111
partitions	-3112
▁}^{	-3113
excess	-3114
inserted	-3115
flush	-3116
▁<<	-3117
itertools	-3118
ff	-3119
sell	-3120
setting	-3121
factorial	-3122
maximized	-3123
Petya	-3124
cubes	-3125
bb	-3126
several	-3127
Day	-3128
Ac	-3129
FF	-3130
ico	-3131
destroy	-3132
RR	-3133
ray	-3134
repeated	-3135
▁'].	-3136
obtained	-3137
▁format	-3138
cru	-3139
inversions	-3140
representing	-3141
'.',	-3142
volum	-3143
mathematical	-3144
Compare	-3145
tracks	-3146
palindromes	-3147
factoriz	-3148
bases	-3149
rounded	-3150
Finally	-3151
paralle	-3152
cc	-3153
exclusion	-3154
*=	-3155
overlaps	-3156
itical	-3157
connecting	-3158
reached	-3159
Pair	-3160
▁float	-3161
('	-3162
velo	-3163
dividing	-3164
differing	-3165
Line	-3166
▁>=	-3167
residues	-3168
▁aaa	-3169
ie	-3170
bott	-3171
oo	-3172
cols	-3173
▁bit	-3174
Fourth	-3175
printed	-3176
langu	-3177
encountered	-3178
broken	-3179
dfs	-3180
offset	-3181
alloc	-3182
▁delta	-3183
thought	-3184
BIT	-3185
ranks	-3186
circular	-3187
Left	-3188
precomputing	-3189
▁’	-3190
increased	-3191
▁using	-3192
ress	-3193
finds	-3194
possibility	-3195
▁)!	-3196
▁)?	-3197
monster	-3198
abil	-3199
lie	-3200
BC	-3201
simulate	-3202
denoting	-3203
ints	-3204
polynomial	-3205
acci	-3206
vot	-3207
failure	-3208
series	-3209
▁pi	-3210
onacci	-3211
false	-3212
job	-3213
▁]+	-3214
▁}".	-3215
Their	-3216
composition	-3217
combine	-3218
hasn	-3219
critical	-3220
ian	-3221
cant	-3222
approx	-3223
relative	-3224
complicates	-3225
mut	-3226
did	-3227
targets	-3228
computes	-3229
instruct	-3230
Polycarp	-3231
▁dp	-3232
Sh	-3233
deleting	-3234
defic	-3235
cyclic	-3236
fav	-3237
iful	-3238
keeping	-3239
rand	-3240
removes	-3241
seat	-3242
####	-3243
cach	-3244
ference	-3245
converted	-3246
automaton	-3247
apples	-3248
bom	-3249
treas	-3250
games	-3251
button	-3252
istic	-3253
pointers	-3254
departure	-3255
ysis	-3256
limited	-3257
beautiful	-3258
cla	-3259
gen	-3260
prog	-3261
occupied	-3262
▁nx	-3263
▁yes	-3264
labels	-3265
▁inclusive	-3266
clique	-3267
aba	-3268
customer	-3269
ifi	-3270
Explanation	-3271
hits	-3272
'>	-3273
▁U	-3274
OUT	-3275
bounds	-3276
termine	-3277
sli	-3278
Addition	-3279
:-	-3280
▁V	-3281
shape	-3282
Push	-3283
▁xi	-3284
optimiz	-3285
nest	-3286
ential	-3287
▁add	-3288
rid	-3289
sent	-3290
walk	-3291
depending	-3292
pivot	-3293
analysis	-3294
field	-3295
drink	-3296
obstacles	-3297
finish	-3298
▁init	-3299
compet	-3300
storing	-3301
achieve	-3302
#.	-3303
sticks	-3304
Determine	-3305
Additionally	-3306
seg	-3307
AP	-3308
optimization	-3309
magic	-3310
itu	-3311
never	-3312
prices	-3313
Cho	-3314
implementation	-3315
lcm	-3316
Ne	-3317
cast	-3318
fractional	-3319
dimension	-3320
company	-3321
inequal	-3322
▁|=	-3323
misunderstanding	-3324
picks	-3325
dro	-3326
request	-3327
fro	-3328
structured	-3329
paren	-3330
obstacle	-3331
▁aab	-3332
section	-3333
powers	-3334
▁first	-3335
stre	-3336
configuration	-3337
IS	-3338
prefixes	-3339
contradiction	-3340
loses	-3341
▁last	-3342
cache	-3343
dimensions	-3344
skill	-3345
reasoning	-3346
ide	-3347
detect	-3348
ignore	-3349
random	-3350
confusing	-3351
bon	-3352
pairing	-3353
▁__(	-3354
According	-3355
▁binary	-3356
marks	-3357
blank	-3358
optimizations	-3359
crossing	-3360
rength	-3361
tasks	-3362
flight	-3363
route	-3364
cable	-3365
fall	-3366
ught	-3367
symmetric	-3368
books	-3369
congruent	-3370
boy	-3371
stores	-3372
determines	-3373
▁,...,	-3374
▁say	-3375
early	-3376
strength	-3377
deletion	-3378
reads	-3379
SP	-3380
........	-3381
Adding	-3382
arp	-3383
▁("{	-3384
apart	-3385
While	-3386
ik	-3387
thres	-3388
repeat	-3389
cry	-3390
cx	-3391
optimally	-3392
ceiling	-3393
peak	-3394
disjoint	-3395
ication	-3396
gine	-3397
corners	-3398
central	-3399
hours	-3400
excluded	-3401
backtrack	-3402
Mer	-3403
rors	-3404
▁two	-3405
cate	-3406
decrement	-3407
parallel	-3408
ply	-3409
lose	-3410
interest	-3411
areas	-3412
orth	-3413
Tak	-3414
volume	-3415
Edges	-3416
contributing	-3417
concatenated	-3418
reversing	-3419
Fibonacci	-3420
▁'?	-3421
▁ai	-3422
stars	-3423
'<	-3424
Query	-3425
votes	-3426
symbo	-3427
▁because	-3428
forming	-3429
▁'}	-3430
duplicate	-3431
XX	-3432
coeff	-3433
au	-3434
comparis	-3435
decess	-3436
dice	-3437
preced	-3438
cip	-3439
miss	-3440
pag	-3441
versa	-3442
icograph	-3443
Same	-3444
exclude	-3445
BA	-3446
'#'	-3447
''.	-3448
heights	-3449
Sw	-3450
view	-3451
atives	-3452
vo	-3453
transformation	-3454
green	-3455
predecess	-3456
creates	-3457
deficit	-3458
houses	-3459
cing	-3460
▁end	-3461
reset	-3462
traverse	-3463
Grundy	-3464
correspond	-3465
dsu	-3466
Num	-3467
suit	-3468
mag	-3469
▁where	-3470
rotating	-3471
loss	-3472
maps	-3473
posed	-3474
cow	-3475
fight	-3476
spell	-3477
ague	-3478
▁and	-3479
simulation	-3480
heappop	-3481
▁='	-3482
applicable	-3483
compat	-3484
lexicograph	-3485
undant	-3486
multiplying	-3487
▁"{	-3488
Cur	-3489
simplif	-3490
div	-3491
lit	-3492
traver	-3493
stage	-3494
triangles	-3495
INPUT	-3496
dots	-3497
threshold	-3498
▁≤	-3499
boundary	-3500
orientation	-3501
collection	-3502
ange	-3503
propag	-3504
skipped	-3505
entirely	-3506
diagonals	-3507
Segment	-3508
support	-3509
Ber	-3510
deltas	-3511
redundant	-3512
ability	-3513
dead	-3514
▁(''.	-3515
▁when	-3516
played	-3517
approxim	-3518
realize	-3519
kill	-3520
metic	-3521
▁mid	-3522
allowing	-3523
coding	-3524
bri	-3525
Number	-3526
employee	-3527
▁}")	-3528
chun	-3529
overflow	-3530
ips	-3531
expects	-3532
OUTPUT	-3533
country	-3534
exponentiation	-3535
nested	-3536
years	-3537
double	-3538
opening	-3539
pict	-3540
quotes	-3541
Min	-3542
▁depth	-3543
factorization	-3544
super	-3545
New	-3546
helper	-3547
Current	-3548
decomposition	-3549
came	-3550
vio	-3551
grids	-3552
tele	-3553
extra	-3554
nj	-3555
▁,...	-3556
signifi	-3557
popped	-3558
edily	-3559
ckets	-3560
ution	-3561
arithmetic	-3562
extend	-3563
Ty	-3564
pho	-3565
outer	-3566
Do	-3567
summing	-3568
▁either	-3569
automatically	-3570
structures	-3571
contradicts	-3572
substitution	-3573
thes	-3574
Steps	-3575
ring	-3576
alternates	-3577
penal	-3578
ME	-3579
▁]):	-3580
const	-3581
food	-3582
vowels	-3583
incoming	-3584
passing	-3585
greedily	-3586
Hel	-3587
palindromic	-3588
got	-3589
avy	-3590
matters	-3591
▁only	-3592
NA	-3593
spells	-3594
multiplication	-3595
uest	-3596
▁time	-3597
ath	-3598
employees	-3599
evens	-3600
conson	-3601
origin	-3602
page	-3603
ah	-3604
querying	-3605
grouping	-3606
vir	-3607
sal	-3608
elevator	-3609
extended	-3610
maintaining	-3611
▁=[	-3612
▁'],	-3613
arrives	-3614
compatible	-3615
catch	-3616
presence	-3617
discre	-3618
soldiers	-3619
intersections	-3620
ital	-3621
neither	-3622
save	-3623
mission	-3624
photo	-3625
happens	-3626
****	-3627
unclear	-3628
issues	-3629
worse	-3630
alphabet	-3631
ament	-3632
ibility	-3633
Help	-3634
pip	-3635
▁'):	-3636
compressed	-3637
ABC	-3638
cars	-3639
selves	-3640
▁sqrt	-3641
mach	-3642
colinear	-3643
robots	-3644
ith	-3645
clust	-3646
▁·	-3647
glish	-3648
course	-3649
touch	-3650
Ke	-3651
wee	-3652
ignored	-3653
foot	-3654
apsack	-3655
significant	-3656
Only	-3657
linked	-3658
members	-3659
_#	-3660
knapsack	-3661
join	-3662
Column	-3663
streak	-3664
snake	-3665
boo	-3666
▁steps	-3667
unlikely	-3668
Choose	-3669
implemented	-3670
Type	-3671
negatives	-3672
indeed	-3673
▁?)	-3674
▁input	-3675
effective	-3676
▁type	-3677
uple	-3678
ler	-3679
angular	-3680
exchange	-3681
▁value	-3682
km	-3683
aks	-3684
Mi	-3685
pix	-3686
Inser	-3687
towns	-3688
meets	-3689
visible	-3690
triple	-3691
sources	-3692
produce	-3693
themselves	-3694
doing	-3695
label	-3696
▁[::-	-3697
merges	-3698
bre	-3699
lamp	-3700
proceeds	-3701
girls	-3702
▁second	-3703
ticket	-3704
reverses	-3705
Even	-3706
involved	-3707
alternating	-3708
prun	-3709
verify	-3710
operators	-3711
pages	-3712
paper	-3713
'-',	-3714
Can	-3715
▁|,	-3716
Assuming	-3717
